Repository: common-repository/automatic-hx-menu
Catalog: lang/automatichxmenu-*.po
Languages: fr_fr

source: Table of Contents
fr_fr: Sommaire de l’article

source: Presentation
fr_fr: Présentation

source: Main settings
fr_fr: Réglages

source: Collapse
fr_fr: Replier

source: Numbering
fr_fr: Numérotation

source: Display
fr_fr: Affichage

source: Support the project
fr_fr: Soutenir le projet

source: Donate
fr_fr: Faire un don

source: What is this plugin for ?
fr_fr: À quoi sert cette extension ?

source: This extension allows to integrate a menu of navigation inside your articles/pages. It is based on the titles found in the article/page.
fr_fr: Cette extension vous permet d’intégrer un menu de navigation à l’intérieur de vos article/pages. Il est construit à partir des titres trouvés dans les articles/pages.

source: This means that you have to tag your articles/pages with heading tags <code>&lt;h1&gt;&lt;/h1&gt;</code>, <code>&lt;h2&gt;&lt;/h2&gt;</code>, and so on.
fr_fr: Cela signifie que vous devez marquer vos articles/pages avec balises de titres <code>&lt;h1&gt;&lt;/h1&gt;</code> , <code>&lt;h2&gt;&lt;/h2&gt;</code> , et ainsi de suite.

source: Choose your mode of operation
fr_fr: Choisissez votre mode de fonctionnement

source: This extension allows to integrate a menu of navigation inside your articles/pages :
fr_fr: Cette extension permet d’intégrer un menu de navigation à l’intérieur de vos articles/pages :

source: Automatically for all your articles according to the defined settings.
fr_fr: Automatiquement pour tous vos articles selon les paramètres définis.

source: Manually by inserting the shortcode <code>[automatichxmenu]</code> into your articles.
fr_fr: Manuellement en insérant le shortcode <code>[automatichxmenu]</code> dans vos articles.

source: Automatically & manually. The shortcode will always have priority over the automatic menu.
fr_fr: Automatiquement et manuellement. Le shortcode aura toujours la priorité sur le menu automatique.

source: Numbering titles
fr_fr: Numérotation des titres

source: This extension can also allow you to automatically numbering your titles by adding the corresponding CSS. You can use automatic numbering independently of the navigation menu integration.
fr_fr: Cette extension peut également vous permettre de numéroter automatiquement vos titres en ajoutant le CSS correspondant. Vous pouvez utiliser la numérotation automatique indépendamment de l’intégration du menu de navigation.

source: Help for translation
fr_fr: Aide pour la traduction

source: If you are interested to help me to correct this english translation, go to plugin page.
fr_fr: Si vous êtes intéressé pour m’aider à corriger la traduction en anglais, allez sur la page du plugin.

source: Smooth scroll
fr_fr: Défilement doux

source: To the top
fr_fr: Vers le haut

source: Button display
fr_fr: Affichage du bouton

source: Numbers in menu
fr_fr: Numéros dans le menu

source: Numbers in article
fr_fr: Numéros dans l’article

source: Menu title
fr_fr: Titre du menu

source: Borders
fr_fr: Bordures

source: Custom CSS
fr_fr: CSS personnalisé

source: yes
fr_fr: oui

source: no
fr_fr: non

source: All
fr_fr: Tout

source: Posts
fr_fr: Articles

source: Center
fr_fr: Centré

source: Left
fr_fr: Gauche

source: Right
fr_fr: Droite

source: default value
fr_fr: valeur par défaut

source: If you choose "Automatic & Shortcode", shortcode will take precedence over the automatic menu
fr_fr: Si vous choisissez « Automatique & Shortcode », le shortcode aura la priorité sur le menu automatique

source: Disabled
fr_fr: Désactivé

source: Automatic
fr_fr: Automatique

source: Shortcode only
fr_fr: Shortcode seulement

source: Automatic & Shortcode
fr_fr: Automatique et shortcode

source: Titles beginning
fr_fr: Titres de départ

source: First title level to be displayed in the menu
fr_fr: Niveau de départ à afficher dans le menu

source: Titles level
fr_fr: Niveau des titres

source: Maximum level of &lt;hx&gt; tags to be displayed in the menu
fr_fr: Niveau maximum des balises <hx> à afficher dans le menu

source: Minimum number of titles
fr_fr: Nombre minimum de titres

source: Minimum number of titles the article should contain before displaying the menu
fr_fr: Nombre minimum de titres que l’article doit contenir avant d’afficher le menu

source: Where to show
fr_fr: Où afficher le menu

source: Choose where to show the menu: on post, on page or both
fr_fr: Choisissez l’emplacement pour afficher le menu : sur les articles, sur les pages ou les deux

source: Show on homepage
fr_fr: Afficher sur la page d’accueil

source: Show the menu on the homepage
fr_fr: Afficher le menu sur la page d’accueil

source: Smooth scroll effect
fr_fr: Effet "smooth scroll"

source: Activate an animated scrolling effect
fr_fr: Activer un effet de défilement animé

source: Speed
fr_fr: Vitesse

source: Offset
fr_fr: Décalage

source: Add "to the top" links
fr_fr: Ajouter des liens « vers le haut »

source: Add links near titles to go back to the top of the page
fr_fr: Ajouter des liens près des titres pour revenir en haut de la page

source: Which pages
fr_fr: Quelles pages

source: Choose where to add the links
fr_fr: Choisissez où ajouter les liens

source: Every pages
fr_fr: Toutes les pages

source: Only pages with nav menu
fr_fr: Uniquement les pages avec menu de navigation

source: Text of links
fr_fr: Texte des liens

source: Where to scroll
fr_fr: Où faire défiler

source: Choose where to scroll
fr_fr: Choisissez jusqu'où faire défiler

source: To the top of the window
fr_fr: En haut de la fenêtre

source: To the navigation menu
fr_fr: Vers le menu de navigation

source: To a custom ID
fr_fr: Vers un ID personnalisé

source: Custom ID
fr_fr: ID personnalisé

source: Alignment
fr_fr: Alignement

source: You need a width < 100% to see the alignement in action
fr_fr: Vous avez besoin d’une largeur <100% pour voir l’alignement en action

source: Width
fr_fr: Largeur

source: Screen width / full width
fr_fr: Largeur de l’écran / pleine largeur

source: Max width of the windows before menu width swap to 100%.
fr_fr: Largeur maximale des fenêtres avant que la largeur du menu ne passe à 100%.

source: Margin
fr_fr: Marges

source: Padding
fr_fr: Marges intérieures

source: Background
fr_fr: Arrière-plan

source: Shift between levels
fr_fr: Espace entre les niveaux

source: Margin between lines
fr_fr: Marge entre les lignes

source: Display the title
fr_fr: Afficher le titre

source: Bold
fr_fr: Gras

source: Italic
fr_fr: Italique

source: Bold & Italic
fr_fr: Gras & italique

source: Color
fr_fr: Couleur

source: Menu borders
fr_fr: Bordures du menu

source: Border color
fr_fr: Couleur de bordure

source: Border style
fr_fr: Style de bordure

source: Solid
fr_fr: Pleine

source: Dashed
fr_fr: Tirets

source: Dotted
fr_fr: Pointillés

source: Border width
fr_fr: Largeur de bordure

source: Border radius
fr_fr: Rayon de bordure

source: Collapse CSS
fr_fr: CSS du menu repliable

source: Collapse menu
fr_fr: Menu repliable

source: Collapse menu items
fr_fr: Replier les éléments du menu

source: Button align
fr_fr: Alignement du bouton

source: Align to the title
fr_fr: Aligné à côté du titre

source: Opposite of the title
fr_fr: Aligné à l'opposé du titre

source: Button background color
fr_fr: Couleur d'arrière-plan du bouton

source: Button text color
fr_fr: Couleur du texte du bouton

source: Active numbering
fr_fr: Numérotation active

source: Enable automatic numbering of titles
fr_fr: Activer la numérotation automatique des titres

source: Hidden
fr_fr: Masqué

source: Creating a menu automatically from the titles of an article
fr_fr: Création d’un menu automatiquement à partir des titres d’un article
